Sinsjr2/Arcavirt/doc/spec/RegisterSvdReference/rx64m-system-pilot.svd
        <register>
          <name>LVD2CR0</name>
          <addressOffset>0xC29B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x82</resetValue>
          <resetMask>0xF7</resetMask>
          <fields>
            <field>
              <name>LVD2RIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVD2DFDIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVD2CMPE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVD2FSAMP</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LVD2RI</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVD2RN</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>DPSBKR%s</name>
          <addressOffset>0xC2A0</addressOffset>
          <size>8</size>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>